# Банкомат выдает сумму максимально возможными купюрами
Sum_Cash = int(input("Введите сумму к выдаче, кратную 100:"))
S1000 = Sum_Cash // 1000
if S1000:
    print("Купюр по 1000 грн. :", S1000)
S500 = (Sum_Cash - S1000 * 1000) // 500
if S500:
    print("Купюр по 500 грн. :", S500)
S200 = (Sum_Cash - S1000 * 1000 - S500 * 500) // 200
if S200:
    print("Купюр по 200 грн. :", S200)
S100 = (Sum_Cash - S1000 * 1000 - S500 * 500 - S200 * 200) // 100
if S100:
    print("Купюр по 100 грн. :", S100)
