# Банкомат выдает сумм мелкими, но не больше 10 штук каждой мелкой купюры
Sum_Cash = int(input("Введите сумму к выдаче, кратную 100:"))
S100 = Sum_Cash // 100
if S100 <= 10:
    print("Купюр по 100 грн. :", S100)
    Sum_Cash -= S100*100
S200 = Sum_Cash // 200
if S200 <= 10 and S200 > 0:
    print("Купюр по 200 грн. :", S200)
    Sum_Cash -= S200*200
elif S200 > 10:
    print("Купюр по 200 грн. :", 10)
    Sum_Cash -= 2000
S500 = Sum_Cash // 500
if S500 <= 10 and S500 > 0:
    print("Купюр по 500 грн. :", S500)
    Sum_Cash -= S500*500
elif S500 > 10:
    print("Купюр по 500 грн. : 10")
    Sum_Cash -= 5000
S1000 = Sum_Cash // 1000
print("Купюр по 1000 грн. :", S1000)
Sum_Cash -= S1000*1000
print("Остаток купюрами по 100 грн.: ", int(Sum_Cash/100))

